#+BEGIN_SRC js
  var name = "pedro";
  var pass = "pica";
  var pago = "visa";
  var age = 40;
  var jsonText = "{" + "\"" + "name" + "\"" + ":" + "\"" + name + "\"" + "," + "\"" +  "pass" + "\"" + ":" + "\"" + pass + "\""   +  "," + "\"" + "pago" + "\"" + ":" + "\"" + pago + "\"" + "," + "\"" + "age" + "\"" + ":" + "\"" + age + "\""  + "}";
  console.log(jsonText);
  var obj = JSON.parse(jsonText);
  console.log(obj.name);
  console.log(obj.pass);
  console.log(obj.pago);
  console.log(obj.age);
#+END_SRC

#+RESULTS:
: {"name":"pedro","pass":"pica","pago":"visa","age":"40"}
: pedro
: pica
: visa
: 40
: undefined


#+BEGIN_SRC js
  class user{
		  constructor(id, name, pass, pago, age){
				  this.id = id;
				  this.name = name;
				  this.pass = pass;
				  this.pago = pago;
				  this.age = age;
		  }
		  changePass(NewPass){
				  this.pass = NewPass;
		  }
		  changeMP(pago){
				  this.pago = pago;
		  }
		  ToMemorie(){
				  jsonText = "{" + "name" + ":" + "\"" + this.name + "\"" + "," +  "pass" + ":" + "\"" + this.pass + "\""   +  "," + "pago" + ":" + "\"" + this.pago + "\"" + "," + "age" + ":" + "\"" + this.age + "\""  + "}";
	
		  }
  }
  var fuser = new user(1, "pedro", "pass", "MC", 40);
	console.log(fuser.name);
	console.log(fuser.age);
	console.log(fuser.id);
#+END_SRC

#+RESULTS:
: pedro
: 40
: 1
: undefined



#+BEGIN_SRC js
// Initialise. If the database doesn't exist, it is created
var lib = new localStorageDB("library", localStorage);

// Check if the database was just created. Useful for initial database setup
if( lib.isNew() ) {

    // create the "books" table
    lib.createTable("books", ["code", "title", "author", "year", "copies"]);

    // insert some data
    lib.insert("books", {code: "B001", title: "Phantoms in the brain", author: "Ramachandran", year: 1999, copies: 10});
    lib.insert("books", {code: "B002", title: "The tell-tale brain", author: "Ramachandran", year: 2011, copies: 10});
    lib.insert("books", {code: "B003", title: "Freakonomics", author: "Levitt and Dubner", year: 2005, copies: 10});
    lib.insert("books", {code: "B004", title: "Predictably irrational", author: "Ariely", year: 2008, copies: 10});
    lib.insert("books", {code: "B005", title: "Tesla: Man out of time", author: "Cheney", year: 2001, copies: 10});
    lib.insert("books", {code: "B006", title: "Salmon fishing in the Yemen", author: "Torday", year: 2007, copies: 10});
    lib.insert("books", {code: "B007", title: "The user illusion", author: "Norretranders", year: 1999, copies: 10});
    lib.insert("books", {code: "B008", title: "Hubble: Window of the universe", author: "Sparrow", year: 2010, copies: 10});

    // commit the database to localStorage
    // all create/drop/insert/update/delete operations should be committed
    lib.commit();
}
#+END_SRC

#+RESULTS:
